package ua.hellil.hudz.lessons.lesson11;

public class BurgerMain {
    public static void main(String[] args) {

//        Зробити клас Burger, який матиме поля:
//        булочка, м'ясо, сир, зелень, майонез
//
//        Зробити три конструктори, які дозволятимуть робити бургери трьох видів:
//        звичайний бургер (усі компоненти)
//        дієтичний бургер (без майонезу)
//        з подвійним м'ясом
//        У кожен конструктор додати виведення в консоль складу даного варіанту бургера
//        (при створенні екземпляра бургера, який використовує даний конструктор - буде виводитися в консоль його склад).
//        Зробити клас BurgerMain, в якому створити три різні бургери. Їхній склад буде автоматично виводитися на екран під час запуску програми.





        Burger standartBurger = new Burger ("Білая булочка", "Куриця", "Сир твердий","Петрушка","Майонез Європейський" );
        Burger dietBurger = new Burger ("Білая булочка", "Куриця","Сир твердий", "Петрушка");
        Burger doubleMeat = new Burger ("Білая булочка", "Куриця", "Індичка", "Сир твердий","Петрушка","Майонез Європейський");

//        


    }
}
