package ua.hellil.hudz.lessons.lesson12;

public class Main {
    public static void main(String[] args) {

        SportMan client1 = new SportMan("Олександр", "Гудзь",21, "04", 1989,
                "098987656", "zefffs@gmail.com",80.5, "120/80", 5500);
        SportMan client2 = new SportMan("Анна", "Давидюк", 17, "12", 1970,
                "098777554", "anna@mail.com", 49.30, "125/85", 7020);
        SportMan client3 = new SportMan("Артем", "Пишний", 23, "06", 1983,
                "098745654", "artem@gmail.com", 98, "140/90", 3000);
        SportMan client4 = new SportMan("Василь", "Кач", 28, "12", 1974,
                "0923377554", "vasil@mail.com", 86, "125/84", 8500);


        client1.printAccountInfo();
        client2.printAccountInfo();
        client3.printAccountInfo();
        client4.printAccountInfo();

        System.out.println();
        System.out.println("Після місяця тренувань результати зменілися");

        client3.setWeight(88);
        client3.setPressure("130/90");
        client3.setStepsOfDay(5200);

        client3.printAccountInfo();

        client2.setSurName("Пишна");
        client2.setStepsOfDay(8000);
        client2.setWeight(60);

        client2.printAccountInfo();











    }
    

//    Зробіть програму для фітнес трекера, яка реєструватиме нового користувача створюючи йому обліковий запис,
//    приймаючи наступні параметри:
//    Незмінні (задаються тільки при створенні облікового запису, і можуть бути отримані лише за допомогою гетерів):
//    Ім'я
//    Дата народження (окремо день, місяць, рік)
//    Емейл
//    Телефон
//    Змінювані:
//    Прізвище
//    Вага
//    Тиск
//    Кількість пройдених за день кроків
//    Створювати кожного користувача необхідно через конструктор, беручи всі поля на вхід конструктора.
//    Додати метод printAccountInfo(), при виклику якого друкувати всі дані про користувача
//    Після прийому року народження - вираховувати вік користувача у внутрішню змінну age (відштовхуючись просто
//    від 2020 року, ускладнювати тут не будемо), на яку зробити тільки геттер і виводити на екран разом з іншими
//    полями в методі printAccountInfo();
//    у конструкторі або геттерах/сеттерах не використовуємо виведення в консоль.
//    У main-класі створити 3-5 користувачів та роздрукувати дані кожного через виклик методу printAccountInfo();
//    для двох користувачів змінити кілька полів та роздрукувати нові дані повторно

}
